---
kind: method
id: M:Autodesk.Revit.DB.AddInId.GetAddInName
source: html/5ce21226-0a63-c759-aff7-0ac08ec6bc73.htm
---
# Autodesk.Revit.DB.AddInId.GetAddInName Method

name of addin associated with this AddInId
 Attempts to obtain the name from loaded Third Party AddIns

## Syntax (C#)
```csharp
public string GetAddInName()
```

## Returns
name of addin